cmsis-svd/cmsis-svd/data/Atmel/ATSAML22J16A.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PM</name>
      <version>2.1.1</version>
      <description>Power Manager</description>
      <groupName>PM</groupName>
      <prependToName>PM_</prependToName>
      <baseAddress>0x40000400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SYSTEM</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>IORET</name>
              <description>I/O Retention</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEPCFG</name>
          <description>Sleep Configuration</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <resetValue>0x02</resetValue>
          <fields>
            <field>
              <name>SLEEPMODE</name>
              <description>Sleep Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SLEEPMODESelect</name>
                <enumeratedValue>
                  <name>IDLE0</name>
                  <description>CPU clock is OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE1</name>
                  <description>AHB clock is OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE2</name>
                  <description>APB clock are OFF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <description>All Clocks are OFF</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BACKUP</name>
                  <description>Only Backup domain is powered ON</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>All power domains are powered OFF</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLCFG</name>
          <description>Performance Level Configuration</description>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PLSEL</name>
              <description>Performance Level Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PLSELSelect</name>
                <enumeratedValue>
                  <name>PL0</name>
                  <description>Performance Level 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PL1</name>
                  <description>Performance Level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PL2</name>
                  <description>Performance Level 2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLDIS</name>
              <description>Performance Level Disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PLRDY</name>
              <description>Performance Level Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PLRDY</name>
              <description>Performance Level Ready interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PLRDY</name>
              <description>Performance Level Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STDBYCFG</name>
          <description>Standby Configuration</description>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <resetValue>0x0400</resetValue>
          <fields>
            <field>
              <name>VREGSMOD</name>
              <description>Voltage Regulator Standby mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>VREGSMODSelect</name>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Automatic mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERFORMANCE</name>
                  <description>Performance oriented</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Low Power oriented</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BBIASHS</name>
              <description>Back Bias for HMCRAMCHS</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
